000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллы/БонусныеБаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БонусныеБаллы</name>
  <comment>Основной раздел учёта системы бонусных накоплений</comment>
  <resources>
    <name>СуммаБонусныхБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Авария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата регистратора</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОперации</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </attributes>
  <attributes>
    <name>Перенос_ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>(Служ.)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонусныхБалловОригинал</name>
    <comment>Сумма до изменения при списании</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.ПрограммыЛояльности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументНачисления</name>
    <type>
      <types>DocumentRef.РеализацияТоваров</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.НачислениеИСписаниеБонусныхБаллов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыУзлов/ВидыУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУзлов</name>
  <enumValues>
    <name>ЦентральныйОфис</name>
  </enumValues>
  <enumValues>
    <name>Магазин</name>
  </enumValues>
  <enumValues>
    <name>ИнтернетМагазин</name>
  </enumValues>
  <enumValues>
    <name>ПустойУзел</name>
  </enumValues>
  <enumValues>
    <name>КСУ_Navision</name>
  </enumValues>
  <enumValues>
    <name>ТестовыйУзел</name>
    <comment>В него всё едет, а из него ничего не выгружается.</comment>
  </enumValues>
  <enumValues>
    <name>УзелРРО</name>
    <comment>Энергонезависимая касса</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоМобильное</name>
  </enumValues>
  <enumValues>
    <name>УзелРасчёта</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/БонусныеБаллы/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)	//	LNK 14.01.2021 10:51:17

	Если НЕ (ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() ИЛИ ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ВидУзла = Перечисления.ВидыУзлов.ТестовыйУзел) Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

			ЗаписьНабора.ДатаИзменения = ТекущаяДатаСеанса();

		КонецЦикла;

	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ОтключитьУправлениеПоследовательностью") Тогда

		Возврат;	//	LNK 06.10.2021 11:38:06

	КонецЕсли;

	Если НЕ ДополнительныеСвойства.Свойство("УправлениеПоследовательностьюБонусныеБаллы") Тогда

		БонусныеБаллыПоследовательность.ПодготовитьДополнительныеСвойства(ДополнительныеСвойства);

	КонецЕсли;

	БлокироватьДляИзменения = Истина;

	РегистрыНакопления.БонусныеБаллы.ИнициализироватьДанныеВлиянияНаПоследовательность(ЭтотОбъект, "ПередЗаписью");

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если НЕ (ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() ИЛИ ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ВидУзла = Перечисления.ВидыУзлов.ТестовыйУзел) Тогда

		Возврат;

	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ОтключитьУправлениеПоследовательностью") Тогда

		Возврат;	//	LNK 06.10.2021 11:38:06

	КонецЕсли;

	РегистрыНакопления.БонусныеБаллы.ИнициализироватьДанныеВлиянияНаПоследовательность(ЭтотОбъект, "ПриЗаписи");

	БонусныеБаллыПоследовательность.УправлениеПоследовательностью(ЭтотОбъект, Отказ);

КонецПроцедуры
